FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_tc.h
/**
 * \file
 *
 * \brief Component description for TC
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_TC_COMPONENT_
#define _SAMD20_TC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TC */
/* ========================================================================== */
/** \addtogroup SAMD20_TC Basic Timer Counter */
/*@{*/

#define REV_TC    0x110

/* -------- TC_CTRLA : (TC Offset: 0x00) (R/W 16) Control A Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t SWRST : 1;     /*!< bit:      0  Software Reset                     */
            uint16_t ENABLE : 1;    /*!< bit:      1  Enable                             */
            uint16_t MODE : 2;      /*!< bit:  2.. 3  Timer Counter Mode                 */
            uint16_t : 1;           /*!< bit:      4  Reserved                           */
            uint16_t WAVEGEN : 2;   /*!< bit:  5.. 6  Waveform Generation Operation      */
            uint16_t : 1;           /*!< bit:      7  Reserved                           */
            uint16_t PRESCALER : 3; /*!< bit:  8..10  Prescaler                          */
            uint16_t RUNSTDBY : 1;  /*!< bit:     11  Run during Standby                 */
            uint16_t PRESCSYNC : 2; /*!< bit: 12..13  Prescaler and Counter Synchronization */
            uint16_t : 2;           /*!< bit: 14..15  Reserved                           */
        } bit;                      /*!< Structure used for bit  access                  */
        uint16_t reg;               /*!< Type      used for register access              */
    } TC_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_CTRLA_OFFSET                0x00      /**< \brief (TC_CTRLA offset) Control A Register */
#define TC_CTRLA_RESETVALUE            0x0000    /**< \brief (TC_CTRLA reset_value) Control A Register */

#define TC_CTRLA_SWRST_Pos             0         /**< \brief (TC_CTRLA) Software Reset */
#define TC_CTRLA_SWRST                 ( 0x1u << TC_CTRLA_SWRST_Pos )
#define TC_CTRLA_ENABLE_Pos            1         /**< \brief (TC_CTRLA) Enable */
#define TC_CTRLA_ENABLE                ( 0x1u << TC_CTRLA_ENABLE_Pos )
#define TC_CTRLA_MODE_Pos              2         /**< \brief (TC_CTRLA) Timer Counter Mode */
#define TC_CTRLA_MODE_Msk              ( 0x3u << TC_CTRLA_MODE_Pos )
#define TC_CTRLA_MODE( value )    ( ( TC_CTRLA_MODE_Msk & ( ( value ) << TC_CTRLA_MODE_Pos ) ) )
#define   TC_CTRLA_MODE_COUNT16        ( 0x0u << 2 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_MODE_COUNT8         ( 0x1u << 2 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_MODE_COUNT32        ( 0x2u << 2 ) /**< \brief (TC_CTRLA)  */
#define TC_CTRLA_WAVEGEN_Pos           5             /**< \brief (TC_CTRLA) Waveform Generation Operation */
#define TC_CTRLA_WAVEGEN_Msk           ( 0x3u << TC_CTRLA_WAVEGEN_Pos )
#define TC_CTRLA_WAVEGEN( value )    ( ( TC_CTRLA_WAVEGEN_Msk & ( ( value ) << TC_CTRLA_WAVEGEN_Pos ) ) )
#define   TC_CTRLA_WAVEGEN_NFRQ        ( 0x0u << 5 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_WAVEGEN_MFRQ        ( 0x1u << 5 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_WAVEGEN_NPWM        ( 0x2u << 5 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_WAVEGEN_MPWM        ( 0x3u << 5 ) /**< \brief (TC_CTRLA)  */
#define TC_CTRLA_PRESCALER_Pos         8             /**< \brief (TC_CTRLA) Prescaler */
#define TC_CTRLA_PRESCALER_Msk         ( 0x7u << TC_CTRLA_PRESCALER_Pos )
#define TC_CTRLA_PRESCALER( value )    ( ( TC_CTRLA_PRESCALER_Msk & ( ( value ) << TC_CTRLA_PRESCALER_Pos ) ) )
#define TC_CTRLA_RUNSTDBY_Pos          11        /**< \brief (TC_CTRLA) Run during Standby */
#define TC_CTRLA_RUNSTDBY              ( 0x1u << TC_CTRLA_RUNSTDBY_Pos )
#define TC_CTRLA_PRESCSYNC_Pos         12        /**< \brief (TC_CTRLA) Prescaler and Counter Synchronization */
#define TC_CTRLA_PRESCSYNC_Msk         ( 0x3u << TC_CTRLA_PRESCSYNC_Pos )
#define TC_CTRLA_PRESCSYNC( value )    ( ( TC_CTRLA_PRESCSYNC_Msk & ( ( value ) << TC_CTRLA_PRESCSYNC_Pos ) ) )
#define   TC_CTRLA_PRESCSYNC_GCLK      ( 0x0u << 12 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_PRESCSYNC_PRESC     ( 0x1u << 12 ) /**< \brief (TC_CTRLA)  */
#define   TC_CTRLA_PRESCSYNC_RESYNC    ( 0x2u << 12 ) /**< \brief (TC_CTRLA)  */
#define TC_CTRLA_MASK                  0x3F6Fu        /**< \brief (TC_CTRLA) MASK Register */

/* -------- TC_READREQ : (TC Offset: 0x02) (R/W 16) Read Request Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t ADDR : 5;  /*!< bit:  0.. 4  Address                            */
            uint16_t : 9;       /*!< bit:  5..13  Reserved                           */
            uint16_t RCONT : 1; /*!< bit:     14  Read Continuously                  */
            uint16_t RREQ : 1;  /*!< bit:     15  Read Request                       */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } TC_READREQ_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_READREQ_OFFSET        0x02            /**< \brief (TC_READREQ offset) Read Request Register */
#define TC_READREQ_RESETVALUE    0x0000          /**< \brief (TC_READREQ reset_value) Read Request Register */

#define TC_READREQ_ADDR_Pos      0               /**< \brief (TC_READREQ) Address */
#define TC_READREQ_ADDR_Msk      ( 0x1Fu << TC_READREQ_ADDR_Pos )
#define TC_READREQ_ADDR( value )    ( ( TC_READREQ_ADDR_Msk & ( ( value ) << TC_READREQ_ADDR_Pos ) ) )
#define TC_READREQ_RCONT_Pos     14              /**< \brief (TC_READREQ) Read Continuously */
#define TC_READREQ_RCONT         ( 0x1u << TC_READREQ_RCONT_Pos )
#define TC_READREQ_RREQ_Pos      15              /**< \brief (TC_READREQ) Read Request */
#define TC_READREQ_RREQ          ( 0x1u << TC_READREQ_RREQ_Pos )
#define TC_READREQ_MASK          0xC01Fu         /**< \brief (TC_READREQ) MASK Register */

