FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_tc.h
/* -------- TC_CTRLBCLR : (TC Offset: 0x04) (R/W  8) Control B Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DIR : 1;     /*!< bit:      0  Counter Direction                  */
            uint8_t  : 1;        /*!< bit:      1  Reserved                           */
            uint8_t ONESHOT : 1; /*!< bit:      2  One-Shot on Counter                */
            uint8_t  : 3;        /*!< bit:  3.. 5  Reserved                           */
            uint8_t CMD : 2;     /*!< bit:  6.. 7  Command                            */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } TC_CTRLBCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_CTRLBCLR_OFFSET             0x04      /**< \brief (TC_CTRLBCLR offset) Control B Clear Register */
#define TC_CTRLBCLR_RESETVALUE         0x02      /**< \brief (TC_CTRLBCLR reset_value) Control B Clear Register */

#define TC_CTRLBCLR_DIR_Pos            0         /**< \brief (TC_CTRLBCLR) Counter Direction */
#define TC_CTRLBCLR_DIR                ( 0x1u << TC_CTRLBCLR_DIR_Pos )
#define TC_CTRLBCLR_ONESHOT_Pos        2         /**< \brief (TC_CTRLBCLR) One-Shot on Counter */
#define TC_CTRLBCLR_ONESHOT            ( 0x1u << TC_CTRLBCLR_ONESHOT_Pos )
#define TC_CTRLBCLR_CMD_Pos            6         /**< \brief (TC_CTRLBCLR) Command */
#define TC_CTRLBCLR_CMD_Msk            ( 0x3u << TC_CTRLBCLR_CMD_Pos )
#define TC_CTRLBCLR_CMD( value )    ( ( TC_CTRLBCLR_CMD_Msk & ( ( value ) << TC_CTRLBCLR_CMD_Pos ) ) )
#define   TC_CTRLBCLR_CMD_NONE         ( 0x0u << 6 ) /**< \brief (TC_CTRLBCLR)  */
#define   TC_CTRLBCLR_CMD_RETRIGGER    ( 0x1u << 6 ) /**< \brief (TC_CTRLBCLR)  */
#define   TC_CTRLBCLR_CMD_STOP         ( 0x2u << 6 ) /**< \brief (TC_CTRLBCLR)  */
#define TC_CTRLBCLR_MASK               0xC5u         /**< \brief (TC_CTRLBCLR) MASK Register */

/* -------- TC_CTRLBSET : (TC Offset: 0x05) (R/W  8) Control B Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DIR : 1;     /*!< bit:      0  Counter Direction                  */
            uint8_t  : 1;        /*!< bit:      1  Reserved                           */
            uint8_t ONESHOT : 1; /*!< bit:      2  One-Shot on Counter                */
            uint8_t  : 3;        /*!< bit:  3.. 5  Reserved                           */
            uint8_t CMD : 2;     /*!< bit:  6.. 7  Command                            */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } TC_CTRLBSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_CTRLBSET_OFFSET             0x05      /**< \brief (TC_CTRLBSET offset) Control B Set Register */
#define TC_CTRLBSET_RESETVALUE         0x00      /**< \brief (TC_CTRLBSET reset_value) Control B Set Register */

#define TC_CTRLBSET_DIR_Pos            0         /**< \brief (TC_CTRLBSET) Counter Direction */
#define TC_CTRLBSET_DIR                ( 0x1u << TC_CTRLBSET_DIR_Pos )
#define TC_CTRLBSET_ONESHOT_Pos        2         /**< \brief (TC_CTRLBSET) One-Shot on Counter */
#define TC_CTRLBSET_ONESHOT            ( 0x1u << TC_CTRLBSET_ONESHOT_Pos )
#define TC_CTRLBSET_CMD_Pos            6         /**< \brief (TC_CTRLBSET) Command */
#define TC_CTRLBSET_CMD_Msk            ( 0x3u << TC_CTRLBSET_CMD_Pos )
#define TC_CTRLBSET_CMD( value )    ( ( TC_CTRLBSET_CMD_Msk & ( ( value ) << TC_CTRLBSET_CMD_Pos ) ) )
#define   TC_CTRLBSET_CMD_NONE         ( 0x0u << 6 ) /**< \brief (TC_CTRLBSET)  */
#define   TC_CTRLBSET_CMD_RETRIGGER    ( 0x1u << 6 ) /**< \brief (TC_CTRLBSET)  */
#define   TC_CTRLBSET_CMD_STOP         ( 0x2u << 6 ) /**< \brief (TC_CTRLBSET)  */
#define TC_CTRLBSET_MASK               0xC5u         /**< \brief (TC_CTRLBSET) MASK Register */

/* -------- TC_CTRLC : (TC Offset: 0x06) (R/W  8) Control C Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t INVEN : 2; /*!< bit:  0.. 1  Output Waveform Invert Enable      */
            uint8_t  : 2;      /*!< bit:  2.. 3  Reserved                           */
            uint8_t CPTEN : 2; /*!< bit:  4.. 5  Capture Channel  Enable            */
            uint8_t  : 2;      /*!< bit:  6.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } TC_CTRLC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_CTRLC_OFFSET        0x06              /**< \brief (TC_CTRLC offset) Control C Register */
#define TC_CTRLC_RESETVALUE    0x00              /**< \brief (TC_CTRLC reset_value) Control C Register */

#define TC_CTRLC_INVEN_Pos     0                 /**< \brief (TC_CTRLC) Output Waveform Invert Enable */
#define TC_CTRLC_INVEN_Msk     ( 0x3u << TC_CTRLC_INVEN_Pos )
#define TC_CTRLC_INVEN( value )    ( ( TC_CTRLC_INVEN_Msk & ( ( value ) << TC_CTRLC_INVEN_Pos ) ) )
#define TC_CTRLC_CPTEN_Pos     4                 /**< \brief (TC_CTRLC) Capture Channel  Enable */
#define TC_CTRLC_CPTEN_Msk     ( 0x3u << TC_CTRLC_CPTEN_Pos )
#define TC_CTRLC_CPTEN( value )    ( ( TC_CTRLC_CPTEN_Msk & ( ( value ) << TC_CTRLC_CPTEN_Pos ) ) )
#define TC_CTRLC_MASK          0x33u             /**< \brief (TC_CTRLC) MASK Register */

/* -------- TC_DBGCTRL : (TC Offset: 0x08) (R/W  8) Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGRUN : 1; /*!< bit:      0  Run During Debug                   */
            uint8_t  : 7;       /*!< bit:  1.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } TC_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_DBGCTRL_OFFSET        0x08            /**< \brief (TC_DBGCTRL offset) Debug Register */
#define TC_DBGCTRL_RESETVALUE    0x00            /**< \brief (TC_DBGCTRL reset_value) Debug Register */

#define TC_DBGCTRL_DBGRUN_Pos    0               /**< \brief (TC_DBGCTRL) Run During Debug */
#define TC_DBGCTRL_DBGRUN        ( 0x1u << TC_DBGCTRL_DBGRUN_Pos )
#define TC_DBGCTRL_MASK          0x01u           /**< \brief (TC_DBGCTRL) MASK Register */

/* -------- TC_EVCTRL : (TC Offset: 0x0A) (R/W 16) Event Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t EVACT : 3; /*!< bit:  0.. 2  Event Action                       */
            uint16_t : 1;       /*!< bit:      3  Reserved                           */
            uint16_t TCINV : 1; /*!< bit:      4  TC Event Input Polarity            */
            uint16_t TCEI : 1;  /*!< bit:      5  TC Event Enable                    */
            uint16_t : 2;       /*!< bit:  6.. 7  Reserved                           */
            uint16_t OVFEO : 1; /*!< bit:      8  Event Output Enable                */
            uint16_t : 3;       /*!< bit:  9..11  Reserved                           */
            uint16_t MCEO : 2;  /*!< bit: 12..13  MC Event Output Enable             */
            uint16_t : 2;       /*!< bit: 14..15  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } TC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_EVCTRL_OFFSET               0x0A      /**< \brief (TC_EVCTRL offset) Event Control Register */
#define TC_EVCTRL_RESETVALUE           0x0000    /**< \brief (TC_EVCTRL reset_value) Event Control Register */

#define TC_EVCTRL_EVACT_Pos            0         /**< \brief (TC_EVCTRL) Event Action */
#define TC_EVCTRL_EVACT_Msk            ( 0x7u << TC_EVCTRL_EVACT_Pos )
#define TC_EVCTRL_EVACT( value )    ( ( TC_EVCTRL_EVACT_Msk & ( ( value ) << TC_EVCTRL_EVACT_Pos ) ) )
#define   TC_EVCTRL_EVACT_OFF          ( 0x0u << 0 ) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_RETRIGGER    ( 0x1u << 0 ) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_COUNT        ( 0x2u << 0 ) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_START        ( 0x3u << 0 ) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_PPW          ( 0x5u << 0 ) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_PWP          ( 0x6u << 0 ) /**< \brief (TC_EVCTRL)  */
#define TC_EVCTRL_TCINV_Pos            4             /**< \brief (TC_EVCTRL) TC Event Input Polarity */
#define TC_EVCTRL_TCINV                ( 0x1u << TC_EVCTRL_TCINV_Pos )
#define TC_EVCTRL_TCEI_Pos             5             /**< \brief (TC_EVCTRL) TC Event Enable */
#define TC_EVCTRL_TCEI                 ( 0x1u << TC_EVCTRL_TCEI_Pos )
#define TC_EVCTRL_OVFEO_Pos            8             /**< \brief (TC_EVCTRL) Event Output Enable */
#define TC_EVCTRL_OVFEO                ( 0x1u << TC_EVCTRL_OVFEO_Pos )
#define TC_EVCTRL_MCEO_Pos             12            /**< \brief (TC_EVCTRL) MC Event Output Enable */
#define TC_EVCTRL_MCEO_Msk             ( 0x3u << TC_EVCTRL_MCEO_Pos )
#define TC_EVCTRL_MCEO( value )    ( ( TC_EVCTRL_MCEO_Msk & ( ( value ) << TC_EVCTRL_MCEO_Pos ) ) )
#define TC_EVCTRL_MASK                 0x3137u   /**< \brief (TC_EVCTRL) MASK Register */

/* -------- TC_INTENCLR : (TC Offset: 0x0C) (R/W  8) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t OVF : 1;     /*!< bit:      0  OVF Interrupt Disable              */
            uint8_t ERR : 1;     /*!< bit:      1  ERR Interrupt Disable              */
            uint8_t  : 1;        /*!< bit:      2  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      3  READY Interrupt Disable            */
            uint8_t MC : 2;      /*!< bit:  4.. 5  MC Interrupt Disable               */
            uint8_t  : 2;        /*!< bit:  6.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } TC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_INTENCLR_OFFSET         0x0C          /**< \brief (TC_INTENCLR offset) Interrupt Enable Clear Register */
#define TC_INTENCLR_RESETVALUE     0x00          /**< \brief (TC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define TC_INTENCLR_OVF_Pos        0             /**< \brief (TC_INTENCLR) OVF Interrupt Disable */
#define TC_INTENCLR_OVF            ( 0x1u << TC_INTENCLR_OVF_Pos )
#define TC_INTENCLR_ERR_Pos        1             /**< \brief (TC_INTENCLR) ERR Interrupt Disable */
#define TC_INTENCLR_ERR            ( 0x1u << TC_INTENCLR_ERR_Pos )
#define TC_INTENCLR_SYNCRDY_Pos    3             /**< \brief (TC_INTENCLR) READY Interrupt Disable */
#define TC_INTENCLR_SYNCRDY        ( 0x1u << TC_INTENCLR_SYNCRDY_Pos )
#define TC_INTENCLR_MC_Pos         4             /**< \brief (TC_INTENCLR) MC Interrupt Disable */
#define TC_INTENCLR_MC_Msk         ( 0x3u << TC_INTENCLR_MC_Pos )
#define TC_INTENCLR_MC( value )    ( ( TC_INTENCLR_MC_Msk & ( ( value ) << TC_INTENCLR_MC_Pos ) ) )
#define TC_INTENCLR_MASK           0x3Bu         /**< \brief (TC_INTENCLR) MASK Register */

/* -------- TC_INTENSET : (TC Offset: 0x0D) (R/W  8) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t OVF : 1;     /*!< bit:      0  OVF Interrupt Enable               */
            uint8_t ERR : 1;     /*!< bit:      1  ERR Interrupt Enable               */
            uint8_t  : 1;        /*!< bit:      2  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      3  READY Interrupt Enable             */
            uint8_t MC : 2;      /*!< bit:  4.. 5  MC Interrupt Enable                */
            uint8_t  : 2;        /*!< bit:  6.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } TC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_INTENSET_OFFSET         0x0D          /**< \brief (TC_INTENSET offset) Interrupt Enable Set Register */
#define TC_INTENSET_RESETVALUE     0x00          /**< \brief (TC_INTENSET reset_value) Interrupt Enable Set Register */

#define TC_INTENSET_OVF_Pos        0             /**< \brief (TC_INTENSET) OVF Interrupt Enable */
#define TC_INTENSET_OVF            ( 0x1u << TC_INTENSET_OVF_Pos )
#define TC_INTENSET_ERR_Pos        1             /**< \brief (TC_INTENSET) ERR Interrupt Enable */
#define TC_INTENSET_ERR            ( 0x1u << TC_INTENSET_ERR_Pos )
#define TC_INTENSET_SYNCRDY_Pos    3             /**< \brief (TC_INTENSET) READY Interrupt Enable */
#define TC_INTENSET_SYNCRDY        ( 0x1u << TC_INTENSET_SYNCRDY_Pos )
#define TC_INTENSET_MC_Pos         4             /**< \brief (TC_INTENSET) MC Interrupt Enable */
#define TC_INTENSET_MC_Msk         ( 0x3u << TC_INTENSET_MC_Pos )
#define TC_INTENSET_MC( value )    ( ( TC_INTENSET_MC_Msk & ( ( value ) << TC_INTENSET_MC_Pos ) ) )
#define TC_INTENSET_MASK           0x3Bu         /**< \brief (TC_INTENSET) MASK Register */

/* -------- TC_INTFLAG : (TC Offset: 0x0E) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t OVF : 1;     /*!< bit:      0  OVF Interrupt Flag                 */
            uint8_t ERR : 1;     /*!< bit:      1  ERR Interrupt Flag                 */
            uint8_t  : 1;        /*!< bit:      2  Reserved                           */
            uint8_t SYNCRDY : 1; /*!< bit:      3  READY Interrupt Flag               */
            uint8_t MC : 2;      /*!< bit:  4.. 5  MC Interrupt Flag                  */
            uint8_t  : 2;        /*!< bit:  6.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } TC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_INTFLAG_OFFSET         0x0E           /**< \brief (TC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define TC_INTFLAG_RESETVALUE     0x00           /**< \brief (TC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define TC_INTFLAG_OVF_Pos        0              /**< \brief (TC_INTFLAG) OVF Interrupt Flag */
#define TC_INTFLAG_OVF            ( 0x1u << TC_INTFLAG_OVF_Pos )
#define TC_INTFLAG_ERR_Pos        1              /**< \brief (TC_INTFLAG) ERR Interrupt Flag */
#define TC_INTFLAG_ERR            ( 0x1u << TC_INTFLAG_ERR_Pos )
#define TC_INTFLAG_SYNCRDY_Pos    3              /**< \brief (TC_INTFLAG) READY Interrupt Flag */
#define TC_INTFLAG_SYNCRDY        ( 0x1u << TC_INTFLAG_SYNCRDY_Pos )
#define TC_INTFLAG_MC_Pos         4              /**< \brief (TC_INTFLAG) MC Interrupt Flag */
#define TC_INTFLAG_MC_Msk         ( 0x3u << TC_INTFLAG_MC_Pos )
#define TC_INTFLAG_MC( value )    ( ( TC_INTFLAG_MC_Msk & ( ( value ) << TC_INTFLAG_MC_Pos ) ) )
#define TC_INTFLAG_MASK           0x3Bu          /**< \brief (TC_INTFLAG) MASK Register */

/* -------- TC_STATUS : (TC Offset: 0x0F) (R/   8) Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 3;         /*!< bit:  0.. 2  Reserved                           */
            uint8_t STOP : 1;     /*!< bit:      3  Stop Status Flag                   */
            uint8_t SLAVE : 1;    /*!< bit:      4  Slave Status Flag                  */
            uint8_t  : 2;         /*!< bit:  5.. 6  Reserved                           */
            uint8_t SYNCBUSY : 1; /*!< bit:      7  Synchronization Busy Status        */
        } bit;                    /*!< Structure used for bit  access                  */
        uint8_t reg;              /*!< Type      used for register access              */
    } TC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_STATUS_OFFSET          0x0F           /**< \brief (TC_STATUS offset) Status Register */
#define TC_STATUS_RESETVALUE      0x08           /**< \brief (TC_STATUS reset_value) Status Register */

#define TC_STATUS_STOP_Pos        3              /**< \brief (TC_STATUS) Stop Status Flag */
#define TC_STATUS_STOP            ( 0x1u << TC_STATUS_STOP_Pos )
#define TC_STATUS_SLAVE_Pos       4              /**< \brief (TC_STATUS) Slave Status Flag */
#define TC_STATUS_SLAVE           ( 0x1u << TC_STATUS_SLAVE_Pos )
#define TC_STATUS_SYNCBUSY_Pos    7              /**< \brief (TC_STATUS) Synchronization Busy Status */
#define TC_STATUS_SYNCBUSY        ( 0x1u << TC_STATUS_SYNCBUSY_Pos )
#define TC_STATUS_MASK            0x98u          /**< \brief (TC_STATUS) MASK Register */

/* -------- TC_COUNT8_COUNT : (TC Offset: 0x10) (R/W  8) COUNT8 COUNT8 Count Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t COUNT : 8; /*!< bit:  0.. 7  Counter Value                      */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } TC_COUNT8_COUNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT8_COUNT_OFFSET        0x10       /**< \brief (TC_COUNT8_COUNT offset) COUNT8 Count Register */
#define TC_COUNT8_COUNT_RESETVALUE    0x00       /**< \brief (TC_COUNT8_COUNT reset_value) COUNT8 Count Register */

#define TC_COUNT8_COUNT_COUNT_Pos     0          /**< \brief (TC_COUNT8_COUNT) Counter Value */
#define TC_COUNT8_COUNT_COUNT_Msk     ( 0xFFu << TC_COUNT8_COUNT_COUNT_Pos )
#define TC_COUNT8_COUNT_COUNT( value )    ( ( TC_COUNT8_COUNT_COUNT_Msk & ( ( value ) << TC_COUNT8_COUNT_COUNT_Pos ) ) )
#define TC_COUNT8_COUNT_MASK          0xFFu      /**< \brief (TC_COUNT8_COUNT) MASK Register */

/* -------- TC_COUNT16_COUNT : (TC Offset: 0x10) (R/W 16) COUNT16 COUNT16 Count Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t COUNT : 16; /*!< bit:  0..15  Counter Value                      */
        } bit;                   /*!< Structure used for bit  access                  */
        uint16_t reg;            /*!< Type      used for register access              */
    } TC_COUNT16_COUNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT16_COUNT_OFFSET        0x10      /**< \brief (TC_COUNT16_COUNT offset) COUNT16 Count Register */
#define TC_COUNT16_COUNT_RESETVALUE    0x0000    /**< \brief (TC_COUNT16_COUNT reset_value) COUNT16 Count Register */

#define TC_COUNT16_COUNT_COUNT_Pos     0         /**< \brief (TC_COUNT16_COUNT) Counter Value */
#define TC_COUNT16_COUNT_COUNT_Msk     ( 0xFFFFu << TC_COUNT16_COUNT_COUNT_Pos )
#define TC_COUNT16_COUNT_COUNT( value )    ( ( TC_COUNT16_COUNT_COUNT_Msk & ( ( value ) << TC_COUNT16_COUNT_COUNT_Pos ) ) )
#define TC_COUNT16_COUNT_MASK          0xFFFFu   /**< \brief (TC_COUNT16_COUNT) MASK Register */

/* -------- TC_COUNT32_COUNT : (TC Offset: 0x10) (R/W 32) COUNT32 COUNT32 Count Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t COUNT : 32; /*!< bit:  0..31  Counter Value                      */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } TC_COUNT32_COUNT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT32_COUNT_OFFSET        0x10       /**< \brief (TC_COUNT32_COUNT offset) COUNT32 Count Register */
#define TC_COUNT32_COUNT_RESETVALUE    0x00000000 /**< \brief (TC_COUNT32_COUNT reset_value) COUNT32 Count Register */

