FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_tc.h
#define TC_COUNT32_COUNT_COUNT_Pos     0          /**< \brief (TC_COUNT32_COUNT) Counter Value */
#define TC_COUNT32_COUNT_COUNT_Msk     ( 0xFFFFFFFFu << TC_COUNT32_COUNT_COUNT_Pos )
#define TC_COUNT32_COUNT_COUNT( value )    ( ( TC_COUNT32_COUNT_COUNT_Msk & ( ( value ) << TC_COUNT32_COUNT_COUNT_Pos ) ) )
#define TC_COUNT32_COUNT_MASK          0xFFFFFFFFu /**< \brief (TC_COUNT32_COUNT) MASK Register */

/* -------- TC_COUNT8_PER : (TC Offset: 0x14) (R/W  8) COUNT8 COUNT8 Period Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PER : 8;   /*!< bit:  0.. 7  Period Value                       */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } TC_COUNT8_PER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT8_PER_OFFSET        0x14         /**< \brief (TC_COUNT8_PER offset) COUNT8 Period Register */
#define TC_COUNT8_PER_RESETVALUE    0xFF         /**< \brief (TC_COUNT8_PER reset_value) COUNT8 Period Register */

#define TC_COUNT8_PER_PER_Pos       0            /**< \brief (TC_COUNT8_PER) Period Value */
#define TC_COUNT8_PER_PER_Msk       ( 0xFFu << TC_COUNT8_PER_PER_Pos )
#define TC_COUNT8_PER_PER( value )    ( ( TC_COUNT8_PER_PER_Msk & ( ( value ) << TC_COUNT8_PER_PER_Pos ) ) )
#define TC_COUNT8_PER_MASK          0xFFu        /**< \brief (TC_COUNT8_PER) MASK Register */

/* -------- TC_COUNT32_PER : (TC Offset: 0x14) (R/W 32) COUNT32 COUNT32 Period Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PER : 32; /*!< bit:  0..31  Period Value                       */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } TC_COUNT32_PER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT32_PER_OFFSET        0x14        /**< \brief (TC_COUNT32_PER offset) COUNT32 Period Register */
#define TC_COUNT32_PER_RESETVALUE    0x00000000  /**< \brief (TC_COUNT32_PER reset_value) COUNT32 Period Register */

#define TC_COUNT32_PER_PER_Pos       0           /**< \brief (TC_COUNT32_PER) Period Value */
#define TC_COUNT32_PER_PER_Msk       ( 0xFFFFFFFFu << TC_COUNT32_PER_PER_Pos )
#define TC_COUNT32_PER_PER( value )    ( ( TC_COUNT32_PER_PER_Msk & ( ( value ) << TC_COUNT32_PER_PER_Pos ) ) )
#define TC_COUNT32_PER_MASK          0xFFFFFFFFu /**< \brief (TC_COUNT32_PER) MASK Register */

/* -------- TC_COUNT8_CC : (TC Offset: 0x18) (R/W  8) COUNT8 COUNT8 Compare and Capture Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CC : 8;    /*!< bit:  0.. 7  Counter/Compare Value              */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } TC_COUNT8_CC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT8_CC_OFFSET        0x18          /**< \brief (TC_COUNT8_CC offset) COUNT8 Compare and Capture Register */
#define TC_COUNT8_CC_RESETVALUE    0x00          /**< \brief (TC_COUNT8_CC reset_value) COUNT8 Compare and Capture Register */

#define TC_COUNT8_CC_CC_Pos        0             /**< \brief (TC_COUNT8_CC) Counter/Compare Value */
#define TC_COUNT8_CC_CC_Msk        ( 0xFFu << TC_COUNT8_CC_CC_Pos )
#define TC_COUNT8_CC_CC( value )    ( ( TC_COUNT8_CC_CC_Msk & ( ( value ) << TC_COUNT8_CC_CC_Pos ) ) )
#define TC_COUNT8_CC_MASK          0xFFu         /**< \brief (TC_COUNT8_CC) MASK Register */

/* -------- TC_COUNT16_CC : (TC Offset: 0x18) (R/W 16) COUNT16 COUNT16 Compare and Capture Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t CC : 16;  /*!< bit:  0..15  Counter/Compare Value              */
        } bit;                 /*!< Structure used for bit  access                  */
        uint16_t reg;          /*!< Type      used for register access              */
    } TC_COUNT16_CC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT16_CC_OFFSET        0x18         /**< \brief (TC_COUNT16_CC offset) COUNT16 Compare and Capture Register */
#define TC_COUNT16_CC_RESETVALUE    0x0000       /**< \brief (TC_COUNT16_CC reset_value) COUNT16 Compare and Capture Register */

#define TC_COUNT16_CC_CC_Pos        0            /**< \brief (TC_COUNT16_CC) Counter/Compare Value */
#define TC_COUNT16_CC_CC_Msk        ( 0xFFFFu << TC_COUNT16_CC_CC_Pos )
#define TC_COUNT16_CC_CC( value )    ( ( TC_COUNT16_CC_CC_Msk & ( ( value ) << TC_COUNT16_CC_CC_Pos ) ) )
#define TC_COUNT16_CC_MASK          0xFFFFu      /**< \brief (TC_COUNT16_CC) MASK Register */

/* -------- TC_COUNT32_CC : (TC Offset: 0x18) (R/W 32) COUNT32 COUNT32 Compare and Capture Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t CC : 32;  /*!< bit:  0..31  Counter/Compare Value              */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } TC_COUNT32_CC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_COUNT32_CC_OFFSET        0x18         /**< \brief (TC_COUNT32_CC offset) COUNT32 Compare and Capture Register */
#define TC_COUNT32_CC_RESETVALUE    0x00000000   /**< \brief (TC_COUNT32_CC reset_value) COUNT32 Compare and Capture Register */

#define TC_COUNT32_CC_CC_Pos        0            /**< \brief (TC_COUNT32_CC) Counter/Compare Value */
#define TC_COUNT32_CC_CC_Msk        ( 0xFFFFFFFFu << TC_COUNT32_CC_CC_Pos )
#define TC_COUNT32_CC_CC( value )    ( ( TC_COUNT32_CC_CC_Msk & ( ( value ) << TC_COUNT32_CC_CC_Pos ) ) )
#define TC_COUNT32_CC_MASK          0xFFFFFFFFu  /**< \brief (TC_COUNT32_CC) MASK Register */

/** \brief TC_COUNT8 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                       /* 8-bit Counter Mode */
    {
        __IO TC_CTRLA_Type CTRLA;        /**< \brief Offset: 0x00 (R/W 16) Control A Register */
        __IO TC_READREQ_Type READREQ;    /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO TC_CTRLBCLR_Type CTRLBCLR;  /**< \brief Offset: 0x04 (R/W  8) Control B Clear Register */
        __IO TC_CTRLBSET_Type CTRLBSET;  /**< \brief Offset: 0x05 (R/W  8) Control B Set Register */
        __IO TC_CTRLC_Type CTRLC;        /**< \brief Offset: 0x06 (R/W  8) Control C Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO TC_DBGCTRL_Type DBGCTRL;    /**< \brief Offset: 0x08 (R/W  8) Debug Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO TC_EVCTRL_Type EVCTRL;      /**< \brief Offset: 0x0A (R/W 16) Event Control Register */
        __IO TC_INTENCLR_Type INTENCLR;  /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear Register */
        __IO TC_INTENSET_Type INTENSET;  /**< \brief Offset: 0x0D (R/W  8) Interrupt Enable Set Register */
        __IO TC_INTFLAG_Type INTFLAG;    /**< \brief Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear Register */
        __I TC_STATUS_Type STATUS;       /**< \brief Offset: 0x0F (R/   8) Status Register */
        __IO TC_COUNT8_COUNT_Type COUNT; /**< \brief Offset: 0x10 (R/W  8) COUNT8 Count Register */
        RoReg8 Reserved3[ 0x3 ];
        __IO TC_COUNT8_PER_Type PER;     /**< \brief Offset: 0x14 (R/W  8) COUNT8 Period Register */
        RoReg8 Reserved4[ 0x3 ];
        __IO TC_COUNT8_CC_Type CC[ 2 ];  /**< \brief Offset: 0x18 (R/W  8) COUNT8 Compare and Capture Register [CC8_NUM] */
    } TcCount8;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

