FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_tc.h
/** \brief TC_COUNT16 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                        /* 16-bit Counter Mode */
    {
        __IO TC_CTRLA_Type CTRLA;         /**< \brief Offset: 0x00 (R/W 16) Control A Register */
        __IO TC_READREQ_Type READREQ;     /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO TC_CTRLBCLR_Type CTRLBCLR;   /**< \brief Offset: 0x04 (R/W  8) Control B Clear Register */
        __IO TC_CTRLBSET_Type CTRLBSET;   /**< \brief Offset: 0x05 (R/W  8) Control B Set Register */
        __IO TC_CTRLC_Type CTRLC;         /**< \brief Offset: 0x06 (R/W  8) Control C Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO TC_DBGCTRL_Type DBGCTRL;     /**< \brief Offset: 0x08 (R/W  8) Debug Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO TC_EVCTRL_Type EVCTRL;       /**< \brief Offset: 0x0A (R/W 16) Event Control Register */
        __IO TC_INTENCLR_Type INTENCLR;   /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear Register */
        __IO TC_INTENSET_Type INTENSET;   /**< \brief Offset: 0x0D (R/W  8) Interrupt Enable Set Register */
        __IO TC_INTFLAG_Type INTFLAG;     /**< \brief Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear Register */
        __I TC_STATUS_Type STATUS;        /**< \brief Offset: 0x0F (R/   8) Status Register */
        __IO TC_COUNT16_COUNT_Type COUNT; /**< \brief Offset: 0x10 (R/W 16) COUNT16 Count Register */
        RoReg8 Reserved3[ 0x6 ];
        __IO TC_COUNT16_CC_Type CC[ 2 ];  /**< \brief Offset: 0x18 (R/W 16) COUNT16 Compare and Capture Register [CC16_NUM] */
    } TcCount16;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief TC_COUNT32 hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                        /* 32-bit Counter Mode */
    {
        __IO TC_CTRLA_Type CTRLA;         /**< \brief Offset: 0x00 (R/W 16) Control A Register */
        __IO TC_READREQ_Type READREQ;     /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
        __IO TC_CTRLBCLR_Type CTRLBCLR;   /**< \brief Offset: 0x04 (R/W  8) Control B Clear Register */
        __IO TC_CTRLBSET_Type CTRLBSET;   /**< \brief Offset: 0x05 (R/W  8) Control B Set Register */
        __IO TC_CTRLC_Type CTRLC;         /**< \brief Offset: 0x06 (R/W  8) Control C Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO TC_DBGCTRL_Type DBGCTRL;     /**< \brief Offset: 0x08 (R/W  8) Debug Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO TC_EVCTRL_Type EVCTRL;       /**< \brief Offset: 0x0A (R/W 16) Event Control Register */
        __IO TC_INTENCLR_Type INTENCLR;   /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear Register */
        __IO TC_INTENSET_Type INTENSET;   /**< \brief Offset: 0x0D (R/W  8) Interrupt Enable Set Register */
        __IO TC_INTFLAG_Type INTFLAG;     /**< \brief Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear Register */
        __I TC_STATUS_Type STATUS;        /**< \brief Offset: 0x0F (R/   8) Status Register */
        __IO TC_COUNT32_COUNT_Type COUNT; /**< \brief Offset: 0x10 (R/W 32) COUNT32 Count Register */
        __IO TC_COUNT32_PER_Type PER;     /**< \brief Offset: 0x14 (R/W 32) COUNT32 Period Register */
        __IO TC_COUNT32_CC_Type CC[ 2 ];  /**< \brief Offset: 0x18 (R/W 32) COUNT32 Compare and Capture Register [CC32_NUM] */
    } TcCount32;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        TcCount8 COUNT8;                      /**< \brief Offset: 0x00 8-bit Counter Mode */
        TcCount16 COUNT16;                    /**< \brief Offset: 0x00 16-bit Counter Mode */
        TcCount32 COUNT32;                    /**< \brief Offset: 0x00 32-bit Counter Mode */
    } Tc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_TC_COMPONENT_ */
